package com.example.task03;

/**
 * Интерфейс для интервалов времени в определенных единицах
 */
public interface TimeUnit {

    /**
     * Возвращает продолжительность текущего интервала, пересчитанного в миллисекундах.
     */
    long toMillis();

    /**
     * Возвращает продолжительность текущего интервала, пересчитанного в секундах.
     */
    long toSeconds();

    /**
     * Возвращает продолжительность текущего интервала, пересчитанного в минутах.
     */
    long toMinutes();

    /**
     * Возвращает количество часов в интервале.
     * При необходимости округлять по обычным правилам округления.
     */
    long getHours(); // Изменено по требованию тестов
}
